Revit 2027 API
MassLevelData.OwningMassId Property
 The ElementId of the mass that the MassLevelData (Mass Floor) is associated with.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId OwningMassId { get; }
Public ReadOnly Property OwningMassId As ElementId
	Get
public:
property ElementId^ OwningMassId {
	ElementId^ get ();
}
member OwningMassId : ElementId with get
Property Value
ElementId
See Also
Reference
MassLevelData Class
Autodesk.Revit.DB.Analysis Namespace